import { Component, OnInit } from '@angular/core';

declare var $: any;

@Component({
  selector: 'app-ope04010609',
  templateUrl: './ope04010609.component.html',
  styleUrls: ['./ope04010609.component.css']
})
export class Ope04010609Component implements OnInit {
  add: number;
  obj: ope;
  beans: Bean[];
  descriptions1: any[] = [];
  descriptions2: any[] = [];
  constructor() {
    this.add = 0;
    this.obj = new ope();
    this.beans = [new Bean()];
    this.descriptions1 = [
      { name: "ประเภทวัตถุดิบ (หน่วย)", content: "ชื่อวัตถุดิบที่ใช้ในการผลิต และหน่วยนับ จากแบบ ภส.๐๗-๐๑/๑ (๑)" },
      { name: "คงเหลือยกมา", content: "จำนวนวัตุดิบคงเหลือจากเดือนก่อน" },
      { name: "รับเดือนนี้", content: "ผลรวมจำนวนหน่วยของการรับวัตุดิบในเดือนนี้ จากแบบ ภส.๐๗-๐๑/๑" },
      { name: "รวม", content: "ผลรวมของ \"คงเหลือยกมา\" + \"รับเดือนนี้\"" },
      { name: "ผลิตสินค้าตามพิกัด ฯ", content: "ผลรวมจำนวนหน่วยของการจ่ายวัตถุดิบเพื่อใช้ในการผลิตสินค้าในพิกัดอัตราภาษีสรรพสามิตในเดือนนี้ จากแบบ ภส.๐๗-๐๑/๑" },
      { name: "เสียหาย", content: "ผลรวมจำนวนหน่วยของการจ่ายวัตถุดิบเพื่อใช้ในการผลิตสินค้าในพิกัดอัตราภาษีสรรพสามิตในเดือนนี้ จากแบบ ภส.๐๗-๐๑/๑" },
      { name: "อื่น ๆ", content: "ผลรวมจำนวนหน่วยของการจ่ายวัตถุดิบเพื่อใช้ในการผลิตสินค้าในพิกัดอัตราภาษีสรรพสามิตในเดือนนี้ จากแบบ ภส.๐๗-๐๑/๑" },
      { name: "คงเหลือยกไป", content: "จำนวนวัตถุดิบคงเหลือ ณ วันสิ้นเดือน ผลต่างของ \"รวม\" - \"ผลิตสินค้าตามพิกัด ฯ\" - \"เสียหาย\" - \"อื่น ๆ\" " },
    ];
    this.descriptions2 = [
      { name: "ชนิดสุรา ชื่อสุรา แรงแอลกอฮอล์ ขนาดบรรจุ หน่วยนับ", content: "ชนิดสุรา เช่น สุรากลั่น สุราแช่ ชื่อสุรา แรงแอลกอฮอล์ ขนาดบรรจุ จากแบบ ภส.๐๗-๐๒/๑ หน่วยนับของสุราสำเร็จรูป เช่น ถัง ขวด กระป๋อง" },
      { name: "คงเหลือยกมา", content: "จำนวนวัตุดิบคงเหลือจากเดือนก่อน" },
      { name: "รับจากการผลิตและปิดแสตมป์แล้ว", content: "ผลรวมจำนวนหน่วยของการรับสินค้าสำเร็จรูปที่ปิดแสตมป์แล้วจำหน่ายในเดือนนี้ จากแบบ ภส.๐๗-๐๒/๑(๒)" },
      { name: "รวม", content: "ผลรวมของ \"คงเหลือยกมา\" + \"รับจากการผลิตและปิดแสตมป์แล้ว\"" },
      { name: "จำน่ายในประเทศ", content: "ผลรวมจำนวนหน่วยของการจ่ายสินค้าสำเร็จรูปที่ปิดแสตมป์แล้วจำหน่ายในประเทศในเดือนนี้ จากแบบ ภส.๐๗-๐๒/๑(๒)" },
      { name: "เสียหาย", content: "ผลรวมจำนวนหน่วยของการจ่ายสินค้าสำเร็จรูปที่ปิดแสตมป์แล้วจำหน่ายในประเทศในเดือนนี้ จากแบบ ภส.๐๗-๐๒/๑(๒)" },
      { name: "อื่น ๆ", content: "ผลรวมจำนวนหน่วยของการจ่ายสินค้าสำเร็จรูปที่ปิดแสตมป์แล้วจำหน่ายในประเทศในเดือนนี้ จากแบบ ภส.๐๗-๐๒/๑(๒)" },
      { name: "คงเหลือยกไป", content: "จำนวนวัตถุดิบคงเหลือ ณ วันสิ้นเดือน ผลต่างของ \"รวม\" - \"จำน่ายในประเทศ\" - \"เสียหาย\" - \"อื่น ๆ\" " },
    ];
  }

  ngOnInit() { }

  ngAfterViewInit() {
    $('.ui.accordion').accordion();
  }

  onDelField = index => {
    this.beans.splice(index, 1);
  };

  onAddField = () => {
    this.beans.push(new Bean());
    this.add++;
    if (this.add >= 1) {

    }
  };

}

class Bean { }

class ope { }