export class BreadcrumbContant {

    b00: any = {
        label: "ตรวจสอบภาษี",
        route: "#"
    }
    b01: any = {
        label: "การคัดเลือกราย",
        route: "#"
    }
    b02: any = {
        label: "สร้างรายการคัดเลือกราย",
        route: "#"
    }
    b03: any = {
        label: "ส่งรายการคัดเลือกราย",
        route: "#"
    }
    b04: any = {
        label: "ตรวจสอบการคัดเลือกราย",
        route: "#"
    }
    b05: any = {
        label: "แผนการตรวจประจำปี",
        route: "#"
    }
    b06: any = {
        label: "รายละเอียดแผนปฏิบัติการ",
        route: "#"
    }
    b07: any = {
        label: "รายการข้อมูลผู้ประกอบการที่เสียภาษีสรรพสามิต",
        route: "#"
    }
    b08: any = {
        label: "กำหนดเงื่อนไขการวิเคราะห์ข้อมูล",
        route: "#"
    }
    b09: any = {
        label: "รายการข้อมูลผู้ประกอบการที่เสียภาษีสรรพสามิตตามเงื่อนไข",
        route: "#"
    }
    b10: any = {
        label: "ค้นหาข้อมูลผู้ประกอบการที่เสียภาษีสรรพสามิต",
        route: "#"
    }
    b11: any = {
        label: "รายชื่อผู้ประกอบการที่เลือก",
        route: "#"
    }
    b12: any = {
        label: "วางแผนการตรวจสอบภาษีประจำปี",
        route: "#"
    }
    b13: any = {
        label: "ขออนุมัติแผนการตรวจสอบภาษี",
        route: "#"
    }
    b14: any = {
        label: "อนุมัติแผนการตรวจสอบภาษี",
        route: "#"
    }
    b15: any = {
        label: "มอบหมายงานให้เจ้าหน้าที่ออกตรวจ",
        route: "#"
    }
    b16: any = {
        label: "แผนการตรวจสอบภาษี (ปฏิทิน)",
        route: "#"
    }
    b17: any = {
        label: "เลือกรายนอกแผน",
        route: "#"
    }
    b18: any = {
        label: "แผนการออกตรวจภาษี",
        route: "#"
    }
}