import { Component, OnInit } from '@angular/core';
import { BreadCrumb } from 'models/index';

@Component({
  selector: 'app-int1103',
  templateUrl: './int1103.component.html',
  styleUrls: ['./int1103.component.css']
})
export class Int1103Component implements OnInit {
  breadcrumb: BreadCrumb[] = [
    { label: "บันทึกข้อความ", route: "#" },
  ];
  comment: string;

  constructor() { }

  ngOnInit() {
    this.comment = `                      
                ตามที่กลุ่มตรวจสอบภายในได้ตรวจสอบการปฏิบัติงานของสำนักงานสรรพสามิตพื้นที่พระนครศรีอยุธยา 2 ซึ่งได้รายงานให้ท่านอธิบดีทราบ และเห็นชอบให้หน่วยรับตรวจดำเนินการตามข้อเสนอแนะ และถือปฏิบัติตามระเบียบ กฎหมาย อย่างเคร่งครัด  นั้น

                กลุ่มตรวจสอบภายใน ขอส่งสำเนารายงานผลการตรวจสอบการปฏิบัติงานของสำนักงานสรรพสามิตพื้นที่พระนครศรีอยุธยา 2 ตามหนังสือกลุ่มตรวจสอบภายใน ที่ กค 0621/198 ลงวันที่  4พฤษภาคม 2560 มาเพื่อโปรดพิจารณาดำเนินการกำกับดูแลการปฏิบัติงานของสำนักงานสรรพสามิตพื้นที่พระนครศรีอยุธยา 2  ให้เป็นไปตามหนังสือดังกล่าวด้วย จะขอบคุณยิ่ง`;
  }

}
